#Задача 3
# Мой вариант оказался не верным
#a = input('Введите число ')
#b = int(a) + int(a)**2 + int(a)**3
#print(b)

n = input('Введите число ')
print(f"{n} + {n + n} + {n + n+ n} = {int(n) + int(n + n) + int(n + n +n)}")
